FROM node:18
#기본 이미지를 node 18버전을 사용한다

WORKDIR /app
#컨테이너의 작업공간을 /app을 기준으로 한다. 
#작업 공간이란 해당 컨테이너로 파일을 넣거나 진입했을 때 기준이 되는 경로

COPY package*.json ./
#호스트 계정에 있는 package로 시작하는 파일명.json 파일을 컨테이너의 ./경로로 복사한다.

RUN npm install
#컨테이너 안에서 npm install 명령어를 수행한다.

COPY . ./
EXPOSE 3000

CMD [ "node", "app.js" ]
#호스트 계정에서 도커파일이 있는 경로의 모든 파일/디렉터리를 컨테이너의
#./경로로 복사.호스트 계정에서 도커파일이 있는 경로의 모든 파일/디렉터리를 컨테이너의 ./ 경로로 복사합니다.
# 마찬 가지로 복사되는 경로는 작업공간(WORKDIR)이 기준입니다.
#여기서 한가지 중요한 점은 Dockerfile을 이용하여 빌드하기 전에 반드시 node_modules를 삭제해주세요
#마지막으로 3000번 포트를 노출하고 컨테이너가 실행될 때 npm run start명령어를 수행



